app/Http/Controllers/api/ClientController.php

    public function index()
    {
        $clients = Client::all();
---
select * from `clients`