app/Http/Controllers/api/CompetitionController.php

    public function index(Request $request)
    {
        $portofolios = Competition::orderBy('updated_at', 'desc')->get();
---
select * from `competitions` order by `updated_at` desc