app/Http/Controllers/api/PortfolioController.php

    public function index(Request $request)
    {
        $portofolios = Portofolio::orderBy('updated_at', 'desc')->take(10)->get();
---
select * from `portofolios` order by `updated_at` desc limit 10