app/Http/Controllers/api/SEOController.php

select * from `s_e_o_s`
---
    public function index()
    {
        $seo = SEO::all();