app/Http/Controllers/api/SkillController.php

    public function index()
    {
        $skills = Skill::orderBy('created_at', 'desc')->get();
---
select * from `skills` order by `created_at` desc