app/Http/Controllers/WelcomeController.php

    public function index()
    {
        $messages = Client::all();
        $skills = Skill::all();
---
select * from `clients`
select * from `skills`